TexasInstruments/simplelink-ble5stack-examples/examples/rtos/CC26X2R1_LAUNCHXL/ble5stack/rtls_coordinator/tirtos7/rtls_coordinator.syscfg
/*
 * Copyright (c) 2018, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
// @cliArgs --board /ti/boards/CC26X2R1_LAUNCHXL --rtos tirtos7

/*
 *  rtls_coordinator.syscfg
 */

/* ======== AESCCM ======== */
var AESCCM = scripting.addModule("/ti/drivers/AESCCM");
var aesccm = AESCCM.addInstance();
aesccm.$name = "Board_AESCCM0";

/* ======== AESECB ======== */
var AESECB = scripting.addModule("/ti/drivers/AESECB");
var aesecb = AESECB.addInstance();
aesecb.$name = "CONFIG_AESECB0";

var aesecb1 = AESECB.addInstance();
aesecb1.$name = "CONFIG_AESECB1";

/* ======== ECDH ======== */
var ECDH = scripting.addModule("/ti/drivers/ECDH");
var ecdh = ECDH.addInstance();
ecdh.$name = "CONFIG_ECDH0";

/* ======== AESCTRDRBG ======== */
var AESCTRDRBG = scripting.addModule("/ti/drivers/AESCTRDRBG");
var aesctrdrbg = AESCTRDRBG.addInstance();



var aesctrdrbg1 = AESCTRDRBG.addInstance();


/* ======== Display ======== */
var Display = scripting.addModule("/ti/display/Display");
var displayUART = Display.addInstance();
displayUART.$hardware = system.deviceData.board.components.XDS110UART;
displayUART.enableANSI = true;
displayUART.uartBufferSize = 128;
displayUART.uart.txPinInstance.initialOutputState = "High";
displayUART.uart.$name = "CONFIG_DISPLAY_UART";
displayUART.uart.txPinInstance.$name = "CONFIG_GPIO_UART_TX";
displayUART.uart.rxPinInstance.$name = "CONFIG_GPIO_UART_RX";

/* ======== GPIO ======== */
var GPIO = scripting.addModule("/ti/drivers/GPIO");

var gpio0 = GPIO.addInstance();
gpio0.$hardware = system.deviceData.board.components.BUTTON0;
gpio0.mode = "Input";
gpio0.$name = "CONFIG_GPIO_BTN1";

var gpio1 = GPIO.addInstance();
gpio1.$hardware = system.deviceData.board.components.BUTTON1;
gpio1.mode = "Input";
gpio1.$name = "CONFIG_GPIO_BTN2";

/* ======== NVS ======== */
var NVS = scripting.addModule("/ti/drivers/NVS");
var nvs = NVS.addInstance();
nvs.internalFlash.regionBase   = 0x48000;
nvs.internalFlash.regionSize   = 0x4000;
nvs.$name = "CONFIG_NVSINTERNAL";

/* ======== RF ======== */
var RF = scripting.addModule("/ti/drivers/RF");

/* ======== TRNG ======== */
var TRNG = scripting.addModule("/ti/drivers/TRNG");
var trng0 = TRNG.addInstance();
var trng1 = TRNG.addInstance();

/* ======== Device ======== */
var device = scripting.addModule("ti/devices/CCFG");
const ccfgSettings = system.getScript("/ti/common/lprf_ccfg_settings.js").ccfgSettings;
for(var setting in ccfgSettings)
{
    device[setting] = ccfgSettings[setting];
}

/* ======== RF Design ======== */
var rfDesign = scripting.addModule("ti/devices/radioconfig/rfdesign");
const rfDesignSettings = system.getScript("/ti/common/lprf_rf_design_settings.js").rfDesignSettings;
for(var setting in rfDesignSettings)
{
    rfDesign[setting] = rfDesignSettings[setting];
}

const radioSettings = system.getScript("/ti/ble5stack/ble_common.js").getRadioScript(rfDesign.rfDesign,system.deviceData.deviceId);
const bleRfDesignSettings = radioSettings.rfDesignParams;
for(var setting in bleRfDesignSettings)
{
    rfDesign[setting] = bleRfDesignSettings[setting];
}

/* ======== Radio ======== */
var custom = scripting.addModule("/ti/devices/radioconfig/custom");
var bleRadioSetModule;

if(rfDesignSettings.rfDesign == "LAUNCHXL-CC1352P-4")
{
    custom.ble = ["bt5le2mp10"];
    bleRadioSetModule = custom.radioConfigbt5le2mp10;
}
else
{
    custom.ble = ["bt5le2m"];
    bleRadioSetModule = custom.radioConfigbt5le2m;
}

bleRadioSetModule.paramVisibility = false;
bleRadioSetModule.settingGroup = "Selectivity";
const bleRadioSettings = radioSettings.radioConfigParams;
for(var setting in bleRadioSettings)
{
    bleRadioSetModule.codeExportConfig[setting] = bleRadioSettings[setting];
}

if(rfDesignSettings.rfDesign == "LAUNCHXL-CC1352P-2" || rfDesignSettings.rfDesign == "LAUNCHXL-CC1352P-4")
{
    bleRadioSetModule.highPA = true;
	if(rfDesignSettings.rfDesign == "LAUNCHXL-CC1352P-4")
	{
        bleRadioSetModule.txPowerHi = "10";
	}
}

/* ======== AoA ======== */
const aoa         = scripting.addModule("/ti/ble5stack/aoa/aoa");

aoa.antTbl.$name                 = "ti_ble5stack_aoa_aoa_ant_tbl0";
aoa.antTbl.ant.create(12);
aoa.antTbl.ant[0].$name          = "Antenna_0";
aoa.antTbl.ant[0].dio[0].$name  = "ti_ble5stack_aoa_aoa_dio0";
aoa.antTbl.ant[1].$name          = "Antenna_1";
aoa.antTbl.ant[1].dio[0].$name  = "ti_ble5stack_aoa_aoa_dio1";
aoa.antTbl.ant[1].dio[0].dio   = 28;
aoa.antTbl.ant[2].$name          = "Antenna_2";
aoa.antTbl.ant[2].dio[0].$name  = "ti_ble5stack_aoa_aoa_dio3";
aoa.antTbl.ant[2].dio[0].dio   = 29;
aoa.antTbl.ant[3].$name          = "Antenna_3";
aoa.antTbl.ant[3].dio.create(2);
aoa.antTbl.ant[3].dio[0].$name  = "ti_ble5stack_aoa_aoa_dio4";
aoa.antTbl.ant[3].dio[0].dio   = 28;
aoa.antTbl.ant[3].dio[1].$name  = "ti_ble5stack_aoa_aoa_dio2";
aoa.antTbl.ant[3].dio[1].dio   = 29;
aoa.antTbl.ant[4].$name          = "Antenna_4";
aoa.antTbl.ant[4].dio[0].$name  = "ti_ble5stack_aoa_aoa_dio5";
aoa.antTbl.ant[4].dio[0].dio   = 30;
aoa.antTbl.ant[5].$name          = "Antenna_5";
aoa.antTbl.ant[5].dio.create(2);
aoa.antTbl.ant[5].dio[0].$name  = "ti_ble5stack_aoa_aoa_dio6";
aoa.antTbl.ant[5].dio[0].dio   = 28;
aoa.antTbl.ant[5].dio[1].$name  = "ti_ble5stack_aoa_aoa_dio7";
aoa.antTbl.ant[5].dio[1].dio   = 30;
aoa.antTbl.ant[6].$name          = "Antenna_6";
aoa.antTbl.ant[6].dio[0].$name  = "ti_ble5stack_aoa_aoa_dio8";
aoa.antTbl.ant[6].dio[0].dio   = 27;
aoa.antTbl.ant[7].$name          = "Antenna_7";
aoa.antTbl.ant[7].dio.create(2);
aoa.antTbl.ant[7].dio[0].$name  = "ti_ble5stack_aoa_aoa_dio9";
aoa.antTbl.ant[7].dio[0].dio   = 27;
aoa.antTbl.ant[7].dio[1].$name  = "ti_ble5stack_aoa_aoa_dio10";
aoa.antTbl.ant[7].dio[1].dio   = 28;
aoa.antTbl.ant[8].$name          = "Antenna_8";
aoa.antTbl.ant[8].dio.create(2);
aoa.antTbl.ant[8].dio[0].$name  = "ti_ble5stack_aoa_aoa_dio11";
aoa.antTbl.ant[8].dio[0].dio   = 27;
aoa.antTbl.ant[8].dio[1].$name  = "ti_ble5stack_aoa_aoa_dio12";
aoa.antTbl.ant[8].dio[1].dio   = 29;
aoa.antTbl.ant[9].$name          = "Antenna_9";
aoa.antTbl.ant[9].dio.create(3);
aoa.antTbl.ant[9].dio[0].$name  = "ti_ble5stack_aoa_aoa_dio13";
aoa.antTbl.ant[9].dio[0].dio   = 27;
aoa.antTbl.ant[9].dio[1].$name  = "ti_ble5stack_aoa_aoa_dio14";
aoa.antTbl.ant[9].dio[1].dio   = 28;
aoa.antTbl.ant[9].dio[2].$name  = "ti_ble5stack_aoa_aoa_dio15";
aoa.antTbl.ant[9].dio[2].dio   = 29;
aoa.antTbl.ant[10].$name         = "Antenna_10";
aoa.antTbl.ant[10].dio.create(2);
aoa.antTbl.ant[10].dio[0].$name = "ti_ble5stack_aoa_aoa_dio16";
aoa.antTbl.ant[10].dio[0].dio  = 27;
aoa.antTbl.ant[10].dio[1].$name = "ti_ble5stack_aoa_aoa_dio17";
aoa.antTbl.ant[10].dio[1].dio  = 30;
aoa.antTbl.ant[11].$name         = "Antenna_11";
aoa.antTbl.ant[11].dio.create(3);
aoa.antTbl.ant[11].dio[0].$name = "ti_ble5stack_aoa_aoa_dio18";
aoa.antTbl.ant[11].dio[0].dio  = 27;
aoa.antTbl.ant[11].dio[1].$name = "ti_ble5stack_aoa_aoa_dio19";
aoa.antTbl.ant[11].dio[1].dio  = 28;
aoa.antTbl.ant[11].dio[2].$name = "ti_ble5stack_aoa_aoa_dio20";
aoa.antTbl.ant[11].dio[2].dio  = 30;

if (system.getRTOS() === "tirtos7")
{
    /* ******* Add SYS/BIOS 7.x to the configuration ********* */
    /* ================ Kernel (SYS/BIOS) configuration ================ */
    const BIOS  = scripting.addModule("/ti/sysbios/BIOS");
    /*
    * Enable asserts in the BIOS library.
    *
    * Pick one:
    *  - true (default)
    *      Enables asserts for debugging purposes.
    *  - false
    *      Disables asserts for a reduced code footprint and better performance.
    */
    //BIOS.assertsEnabled = true;
    BIOS.assertsEnabled = false;

